; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	GroundStation4 - direction
	GroundStation7 - direction
	GroundStation10 - direction
	GroundStation9 - direction
	GroundStation6 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star8 - direction
	GroundStation5 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation10)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star11)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star11)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon15)
)
(:goal (and
	(pointing satellite0 Star11)
	(pointing satellite2 GroundStation10)
	(have_image Star12 thermograph1)
	(have_image Planet13 thermograph1)
	(have_image Phenomenon14 thermograph1)
	(have_image Phenomenon15 thermograph1)
	(have_image Phenomenon16 thermograph1)
	(have_image Phenomenon17 spectrograph0)
	(have_image Phenomenon18 thermograph1)
	(have_image Star19 thermograph1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
2. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 0 of 10
3. (turn_to satellite0 phenomenon17 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon17)
   goals met: 0 of 10
4. (take_image satellite0 phenomenon17 instrument1 spectrograph0)
   added: (have_image phenomenon17 spectrograph0)
   goals met: 1 of 10
5. (turn_to satellite0 phenomenon16 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 10
6. (take_image satellite0 phenomenon16 instrument1 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 2 of 10
7. (turn_to satellite0 phenomenon15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 10
8. (take_image satellite0 phenomenon15 instrument1 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 3 of 10
9. (turn_to satellite0 phenomenon14 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 10
10. (take_image satellite0 phenomenon14 instrument1 thermograph1)
   added: (have_image phenomenon14 thermograph1)
   goals met: 4 of 10
11. (turn_to satellite0 phenomenon18 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon18)
   goals met: 4 of 10
12. (take_image satellite0 phenomenon18 instrument1 thermograph1)
   added: (have_image phenomenon18 thermograph1)
   goals met: 5 of 10
13. (turn_to satellite0 planet13 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 planet13)
   goals met: 5 of 10
14. (take_image satellite0 planet13 instrument1 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 6 of 10
15. (turn_to satellite0 star12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star12)
   goals met: 6 of 10
16. (take_image satellite0 star12 instrument1 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 7 of 10
17. (turn_to satellite0 star19 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star19)
   goals met: 7 of 10
18. (take_image satellite0 star19 instrument1 thermograph1)
   added: (have_image star19 thermograph1)
   goals met: 8 of 10
19. (turn_to satellite0 star11 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 star11)
   goals met: 9 of 10
20. (turn_to satellite2 groundstation10 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 groundstation10)
   goals met: 10 of 10
